Revit 2024 API
AlignmentStationLabel.IsValid Method
 Checks if this object is a valid alignment station label.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021.1
Syntax
C#
public bool IsValid()
Visual Basic
Public Function IsValid As Boolean
Visual C++
public:
bool IsValid()
See Also
AlignmentStationLabel Class
IsValid Overload
Autodesk.Revit.DB.Infrastructure Namespace